/******************************************************************************
* 文件名: jcdbusclient.h
* 描述: JC-DBUS通信框架客户模块
* Copyright(c)2014-2016 JCDZ Co.,Ltd.
*
* 修改记录:
* --------------------
* v1.0   2014/04/03 20:42:50, lys 创建文件
*
******************************************************************************/
#ifndef _JCDBUSCLIENT_H_
#define _JCDBUSCLIENT_H_

#if defined(__linux) || defined(__APPLE__) || defined(__CYGWIN__)
#include <sys/time.h>
#else
#include <windows.h>
#endif
#include "jcbase.h"

class JCDbusDaemon;
class JCDbusMsgRoute;
class JCDbusMsgInfo;
class JCDbusMsg;
class JCDbusDaemonConfig;
class JCThread;
class JCUdtNormalSocket;

/******************************************************************************
* 函数名:JCDbusClient
* 描述: JCDbus通信客户模块
*
* 输入:
* 输出:
* 返回值:
*
* 修改记录:
* --------------------
*    2014/04/07 22:53:27, lys 创建函数
*
******************************************************************************/
class DLL_EXPORT JCDbusClient
{
public:
    /******************************************************************************
    * 函数名:JCDbusClient.JCDbusClient
    * 描述: -
    *
    * 输入: pDaemon JCDbus通信后台管理器指针 nLocalId 通信客户端模块统一编号
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2014/04/07 22:53:45, lys 创建函数
    *
    ******************************************************************************/
	JCDbusClient(JCDbusDaemon *pDaemon, unsigned int nLocalId);
	virtual ~JCDbusClient();

    /******************************************************************************
    * 函数名:JCDbusClient.Run
    * 描述: 客户模块与daemon建立连接并启动消息队列运行
    *
    * 输入:
    * 输出:
    * 返回值: true 成功 false 失败
    *
    * 修改记录:
    * --------------------
    *    2014/04/07 22:55:34, lys 创建函数
    *
    ******************************************************************************/
	bool Run();

    /******************************************************************************
    * 函数名:JCDbusClient.Stop
    * 描述: 通过向本模块发送停止消息,是消息队列线程正常退出(线程异步退出,需要一定的等待时间)
    *
    * 输入:
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2014/04/07 22:57:28, lys 创建函数
    *
    ******************************************************************************/
	bool Stop();

    /******************************************************************************
    * 函数名:JCDbusClient.BreakSyncIoBlock
    * 描述: 用于解除模块线程因IO阻塞引起的线程阻塞, 如导致模块无法退出,无法处理新消息等情况
    *
    * 输入:
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2014/04/07 22:57:28, lys 创建函数
    *
    ******************************************************************************/
	bool BreakSyncIoBlock();

    /******************************************************************************
    * 函数名:JCDbusClient.GetFrontMessage
    * 描述: 从消息队列头部取消息
    *
    * 输入:
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2014/04/07 22:58:42, lys 创建函数
    *
    ******************************************************************************/
	bool GetFrontMessage(JCDbusMsg &tMsg);

    /******************************************************************************
    * 函数名:JCDbusClient.GetSpecMessage
    * 描述: 从消息队列中搜寻指定消息并取出(建议不要和GetFrontMessage在不同线程调用,以免产生竞争条件)
    *
    * 输入: tMsg的msginfo填入制定的消息信息
    * 输出: tMsg装载完整消息内容
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2014/04/07 23:5:10, lys 创建函数
    *
    ******************************************************************************/
	bool GetSpecMessage(JCDbusMsg &tMsg, unsigned int nTimeOut = 3000);

	/******************************************************************************
    * 函数名:JCDbusClient.GetSpecClientMessage
    * 描述: 从消息队列中搜寻指定Client发送的指定消息并取出(建议不要和GetFrontMessage在不同线程调用,以免产生竞争条件)
	*       判断规则: tWait.m_nClientId & tRecv.m_nClientId && tWait == tRecv
    * 输入: tMsg的msginfo填入制定的消息信息
    * 输出: tMsg装载完整消息内容
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2014/04/07 23:5:10, lys 创建函数
    *
    ******************************************************************************/
	bool GetSpecClientMessage(JCDbusMsg &tMsg, unsigned int nTimeOut = 3000);

    /******************************************************************************
    * 函数名:JCDbusClient.ClientSendMessage
    * 描述: 向指定模块发送消息(二级客户端模块可能需改写)
    *
    * 输入:
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2014/04/07 23:8:9, lys 创建函数
    *
    ******************************************************************************/
 	virtual bool ClientSendMessage(JCDbusMsg &tMsg);

    /******************************************************************************
    * 函数名:JCDbusClient.QueryModule
    * 描述: 查询指定模块是否在线
    *
    * 输入: tDest指定模块定位信息
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2014/04/07 23:9:34, lys 创建函数
    *
    ******************************************************************************/
	bool QueryModule(const JCDbusMsgRoute &tDest);

	/******************************************************************************
    * 函数名:JCDbusClient.IsClientStop
    * 描述: 用于检查客户模块线程是否已停止
    *
    * 输入:
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2014/04/07 23:10:31, lys 创建函数
    *
    ******************************************************************************/
	bool IsClientStop();

    /******************************************************************************
    * 函数名:JCDbusClient.ShowClientInfo
    * 描述: 显示客户模块信息,调试用
    *
    * 输入:
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2014/04/07 23:10:31, lys 创建函数
    *
    ******************************************************************************/
	void ShowClientInfo();

	/******************************************************************************
    * 函数名:JCDbusClient.ClientClearAllSpecMsg
    * 描述: 清空指定ID消息，用于处理超时重发命令时，重复收包的处理
    *
    * 输入:
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2014/10/17 16:10:31, gaopeng 创建函数
    *
    ******************************************************************************/
	int ClientClearAllSpecMsg(JCDbusMsgInfo& tMsgInfo);

	/******************************************************************************
    * 函数名:JCDbusClient.InitLocalDaemon
    * 描述: 初始化二级客户端消息队列
    *
    * 输入:
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2014/12/31 14:43:31, gaopeng 创建函数
    *
    ******************************************************************************/
	void InitLocalDaemon(JCDbusDaemon *pLocalDaemon);

	/******************************************************************************
    * 函数名:JCDbusClient.MessageCount
    * 描述: 获取客户端消息队列中消息数目
    *
    * 输入:
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2015/07/15 14:43:31, lys 创建函数
    *
    ******************************************************************************/
	unsigned int MessageCount();

	/******************************************************************************
    * 函数名:JCDbusClient.GetModuleId
    * 描述: 获取客户端模块ID
    *
    * 输入:
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2015/07/15 14:43:31, lys 创建函数
    *
    ******************************************************************************/
	unsigned int GetModuleId();

	/******************************************************************************
    * 函数名:JCDbusClient.GetDaemonId
    * 描述: 获取客户端模块连接的DaemonID
    *
    * 输入:
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2015/07/15 14:43:31, lys 创建函数
    *
    ******************************************************************************/
	unsigned int GetDaemonId();

	/******************************************************************************
    * 函数名:JCDbusClient.GetDaemonConfig
    * 描述: 获取daemon详细信息
    *
    * 输入:
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2014/10/22 14:44:17, lys 创建函数
    *
    ******************************************************************************/
	JCDbusDaemonConfig &GetDaemonConfig();
	JCUdtNormalSocket & GetUdtNormalSocket();

protected:
	unsigned int m_nModuleId;

    /******************************************************************************
    * 函数名:JCDbusClient.HandleUserMessage
    * 描述: 用户消息处理函数入口(用户重载此函数添加自定义消息处理)
    *
    * 输入:
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2014/04/07 23:10:59, lys 创建函数
    *
    ******************************************************************************/
	virtual bool HandleUserMessage(JCDbusMsg &tMsg);

    /******************************************************************************
    * 函数名:JCDbusClient.OnStop
    * 描述: 用户定制模块停止行为,在stop中被调用
    *
    * 输入:
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2014/04/16 14:44:17, lys 创建函数
    *
    ******************************************************************************/
	virtual void OnStop();

	/******************************************************************************
    * 函数名:JCDbusClient.OnUdtConnect
    * 描述: JCDbus机器之间UDT连接成功的响应函数, tMsg中发送方daemonId即为新连接的远程daemon的ID
    *
    * 输入:
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2014/10/22 14:44:17, lys 创建函数
    *
    ******************************************************************************/
	virtual void OnUdtConnect(JCDbusMsg &tMsg);

	/******************************************************************************
    * 函数名:JCDbusClient.OnUdtDisConnect
    * 描述: JCDbus机器之间UDT连接断开的响应函数, tMsg中发送方daemonId即为断开的远程daemon的ID
    *
    * 输入:
    * 输出:
    * 返回值:
    *
    * 修改记录:
    * --------------------
    *    2014/10/22 14:44:17, lys 创建函数
    *
    ******************************************************************************/
	virtual void OnUdtDisConnect(JCDbusMsg &tMsg);

private:
	static unsigned long WINAPI ClientThread(LPVOID pParam);
	virtual bool ClientProc();
	bool HandleJCDbusMessage(JCDbusMsg &tMsg);
	bool HandleInnerMessage(JCDbusMsg &tMsg);
	void DoStop();
	void DoQueryModule(const JCDbusMsg &tMsg);
	bool Connect();
	bool DisConnect();

	JCDbusDaemon *m_pDaemon;
	/************************************************************************/
	/* m_pLocalDaemon二级客户端本地消息队列使用,解决二级客户端GetSpecMessage*/
	/* GetFrontMessage获取本队列消息,又要向一级客户端模块发送消息的问题		*/
	/************************************************************************/
	JCDbusDaemon *m_pLocalDaemon;
	JCThread *m_pThread;
	bool m_bStop;
	bool m_bIsSecondLevelClient;
};

#endif /* _JCDBUSCLIENT_H_ */

